Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: Now let's try to get our heads around what the gradient of a function of three variables looks like.
ht: Koulye a n fè efò pou pran tèt nou nan sa a dégradé yon fonksyon de twa variables recherche renmen.

source: So the easiest one for me to imagine is a scalar field.
ht: Se konsa, la plus lòt la pou m' pou imajine se yon jaden scalar.

source: So what's a scalar field?
ht: Se poutèt sa se yon jaden scalar?

source: One that I find fairly intuitive is temperature in a three-dimensional room.
ht: Lè sa a, youn ke mwen jwenn assez intuitive se tanperati nan yon chanm en.

source: So let's say the temperature in a room is a function of where I am in the room.
ht: Se konsa nou di tanperati a nan yon chanm se yon fonksyon de kote m' nan sal la.

source: So let's say it's a function of my x, y, and z coordinates.
ht: Se konsa nou di se yon fonksyon m' x, y, ak z coordonnées.

source: And I don't know, I have never actually modeled temperature.
ht: Apre sa, mwen pa konnen, mwen te janm aktyèlman Sur tanperati.

source: But let's say I have, I don't know, a 20 kelvin-- actually, let me make it so that our vector field works out right.
ht: Men, ann di m, mwen pa konnen, yon kelvin gen 20 - aktyèlman, pou m' fè l' lè sa a, jaden vecteur nou travay sou bò dwat.

source: Let's say we have a 10 kelvin heat force in the center of our room.
ht: An n di nou gen yon chalè 10 kelvin fòs nan sant de chanm nou.

source: I can imagine as you go further and further away from that heat source it's going to get colder and colder.
ht: Mwen ka konprann tankou ou ale pi lwen Et plus kite sa chalè sòs li pwal jwenn plus Et plus.

source: So let's say that the temperature function.
ht: Se konsa nou di sa fonksyon tanperati a.

source: And let's say that center of the room is at the coordinates x, y, and z is equal to 0.
ht: An n pale sa sant nan sal la se nan les coordonnées x, y, Et z rive fè 0.

source: So let's say our temperature function-- I'm just making this up, I don't know if this is an accurate model of temperature-- it's equal to 10 times e to the minus r squared.
ht: Se konsa nou di nou tanperati fonksyon-mwen annik fè sa leve, mwen pa konnen si sa a se yon modèl précis de tanperati- li rive fè sistèm 10 fwa e a r moins au.

source: Now why did I say r?
ht: Koulye a Poukisa mwen pa mande r.

source: I said it's a function of x, y, and z.
ht: Mwen te di se yon fonksyon de x, y, Et z.

source: Well I'm just saying that it exponentially decays as you get further and further away from that source.
ht: Men m' ap annik di ke sa façon s' tankou ou obtenir plus e pli lwen kite sous sa.

source: Kind of radially further and further away from that source.
ht: Ti jan radialement plus e pli lwen kite sous sa.

source: So what's the radial distance away?
ht: Se poutèt sa ki toupre a radial kote?

source: And this actually isn't that relevant to learning gradients, but let's get a little intuition about what that actual temperature function-- how it actually changes as you go through the room.
ht: Ak bagay sa a aktyèlman pa ki enpòtan pou apwann dégradé, Men, an nou jwenn yon ti entwisyon an sou ki sa tanperati réel fonksyon-jan li aktyèlman chanje jan ou ale nan sal la.

source: So the radius away from the center, that's just going to be r squared is just x squared plus y squared plus z squared.
ht: Se konsa adiyis kite sant lan, sa sèlman pwal r au se jis x au plis y au plis z au.

source: That's just the Pythagorean theorem in three dimensions.
ht: Sa se sèlman a pitagorik teyorèm nan dimansyon twa.

source: So let's write our temperature function.
ht: Se konsa nou ekri nou fonksyon tanperati.

source: So let's write temperature as a function of x, y, and z is equal to 10 e to the minus x squared plus y squared plus z squared-- which is exactly what I wrote up here.
ht: Se konsa nou ekri tanperati kòm yon fonksyon de x y, z se egal-ego pou 10 e pou a x moins au plus y au plis z au ­ ki se ekzateman kisa m' a moute isit la.

source: Instead of x squared plus y squared plus z squared, I wrote r squared, just to kind of give you the intuition that this expression is just saying the square of the distance as we get away from the center of our room, or from the coordinate 0, 0, 0.
ht: Olye ke l x au plus y au plis z au, mwen te pale a tou r au, jis ti jan fè pou ou a, entwisyon an sa sa espresyon di ti lakou a distans kòm nou chape nan mitan de chanm nou, ou de la koòdone 0, 0, 0.

source: But that's not what we're learning here.
ht: Men sa se pa sa nou ap aprann isit la.

source: But I want you to understand, at least conceptualize this, it's hard to draw a scalar field.
ht: Men, mwen vle nou konprann, se pi piti designers sa a, li difisil pou desine yon jaden scalar.

source: All a scalar field means is that in any point in this base-- and in this case we're dealing with three-dimensional space-- at any point in that space we can associate a value.
ht: Tout yon jaden scalar mwayen se sa nan kèk pwen nan sa baz - Et tap nan ka sa nou ap negosye ak en galeri-nan kèk pwen nan plas sa nou ka asosye pri.

source: And that makes sense.
ht: Et, sa fè sans.

source: If you were to take a thermometer and measure any point in space in the room that you're in right now, you would get a temperature.
ht: Si nou te pran yon tèmomèt ak mezire tout pwent (n) nan espas nan chanm sa ou gen nan kounye a, ou ta ka jwenn yon tanperati a.

source: You wouldn't get a temperature and a direction, so it's not a vector field.
ht: Ou ne jwenn yon tanperati ak yon direksyon, se konsa li genyen pa yon vecteur jaden.

source: You would just get a temperature.
ht: Ou ta ka jwenn jis yon tanperati.

source: And that's why it's called a scalar field.
ht: Et se poutèt sa li te rele pou yon scalar jaden.

source: Associated with every coordinate is just a temperature.
ht: Asosye nan chak koòdone se sèlman yon tanperati a.

source: So how would we view the gradient of this function?
ht: Se konsa jan nou ta wè dégradé fonksyon sa a?

source: Well the gradient of this function is going to tell us in which direction-- and actually, the gradient of this function is going to generate a vector field, because it's going to tell us in which direction do we have the largest increase in temperature.
ht: Byen dégradé fonksyon sa a va di nou nan direksyon ki - Et aktyèlman, a dégradé fonksyon sa a va pou générer yon jaden vecteur, paske li pwal di nou nan direksyon ki fè nou gen pi gwo fè vini pi gran nan tanperati.

source: And also, the magnitude of those vectors in that vector field will tell us how large of an increase in temperature we are looking at.
ht: Et tou, magnitid vecteurs sa nan vecteur sa jaden p'ap di nou ki jan gwo de yon ogmantasyon nan tanperati nou ta renmen wè nan.

source: Or you can kind of view it as almost a three-dimensional slope.
ht: Ou ou ka ti jan wè l' tankou prèt pou yon pant en.

source: Hope that doesn't confuse you.
ht: Espere ke sa pa twouble w.

source: So let's compute the gradient, and then I'll show you a diagram that might make things a little bit more intuitive.
ht: Se konsa an n kalkile dégradé la, epi lè sa a m ap montre ou yon dyagram sa yo ki te fè sa yon ti jan plis intuitive.

source: Let me erase this thing down here.
ht: Pou m' efase sa ki rive a desann isit la. . m' ap kouri pou chanje de sa a koulè ble, paske

source: And I'm going to switch from this blue color, because it's a little nauseating.
ht: li yon ti jan nauseating.

source: So the gradient of T is going to be equal to the partial derivative T with respect to x times the unit vector in the x direction, plus the partial derivative of the temperature function with respect to y times the unit vector in the y direction, plus the partial derivative of the temperature function with respect to z times the unit vector in the z direction.
ht: Se konsa, dégradé ki T ap egal a partiel dérivés T osijè de x fwa a vecteur inite w la nan x a direksyon, plis a dérivés partielle de tanperati a fonksyon osijè de y fwa a vecteur inite w la nan y a direksyon, plis a dérivés partielle de tanperati a fonksyon osijè de z fwa vecteur inite w la a nan direksyon z.

source: And now we just plug and chug and figure out the partial derivatives.
ht: Et, koulye a nou jis priz kouran Et chug Et evalye a dérivés partielle.

source: So the gradient of T is equal to-- now you might be daunted.
ht: Se konsa dégradé de T rive fè - koulye a ou peut être daunted.

source: Oh, I have an e to this three variable function, how do I take the partial derivative?
ht: O, mwen gen yon sistèm e pou yo fonksyone varyasyon twa sa a, men, ou pran dérivés partielle a?

source: Remember, if you're taking the partial derivative with respect to x you just pretend like the y's and the z's are constants.
ht: Pa bliye, si ou ap jwe ak dérivés partielle ak respè pou x ou sèlman pretann tankou y's Et les z's sont constantes.

source: So let's do that.
ht: Se konsa nou fè sa.

source: So let's take the derivative of the inside function.
ht: Se konsa an n pran dérivés de l' an fonksyon.

source: That's the way I view it.
ht: Se konsa mwen wè l.

source: So minus x squared plus y squared plus z squared, with respect to x.
ht: Se konsa moins x au plus y au plis z au, osijè de x.

source: So you could distribute this minus if you like.
ht: Se konsa, ou te kapab distribye mwens sa a tankou si vous.

source: So it'd be minus x squared minus y squared minus z squared.
ht: Se konsa li ta x au moins y au moins moins au z.

source: So the derivative of that with respect to x is just going to be-- these are just constants, so the derivative with respect to x is just 0.
ht: Se konsa dérivés de sa osijè de x sèlman pwal pou ki sa yo sèlman konstant yo, se konsa dérivés ak respè pou x se jis 0.

source: So the derivative is minus 2x. Right?
ht: Se konsa dérivés a se moins 2 x. pa vre?

source: Minus 2x is the derivative of minus x squared.
ht: Moins 2 x se dérivés de x au moins.

source: Minus 2x times the derivative of the outside.
ht: Moins x 2 fwa dérivés de deyò.

source: Well, what's the derivative of e to the x?
ht: Men, ki sa ki dérivés de e pou x a?

source: The derivative of e to the x is e to the x.
ht: Dérivés de e pou x a se e pou x an.

source: That's why e is such an amazing number.
ht: Se poutèt sa e se konsa yon nonm dwòl.

source: And this 10 here, this is just a constant that when you take the derivative of a constant times something the constant carries over.
ht: Et 10 sa a isit la, men se sèlman pèmanan ki lè ou te pran dérivés de konstant yon fwa pa yon bagay la konstant pote yo.

source: So the derivative of the outside expression, the way I imagine it, is equal to 10 e to the minus x squared plus y squared plus z squared.
ht: Se konsa a dérivés en lapawòl a, konsa mwen kwè l, egal a 10 e pou yo a mwens x plis au y au plis z au.

source: And then all of that times the unit vector in the i direction. Right?
ht: Et lè sa a tout moun ki toujou vecteur inite w la a m a nan direksyon. pa vre?

source: And now we can do the same thing for the y direction.
ht: Apre sa, koulye a nou ka fè menm bagay sa pou direksyon y.

source: So plus-- what's the partial derivative of this with respect to y?
ht: Pour plus - sa se a dérivés partielle de sa osijè de y?

source: Well it's going to look very similar.
ht: Men li pwal sanble trè menm jan an.

source: The partial derivative of this inner function with respect to y, it's minus y squared.
ht: A dérivés partielle de sa a bò/pa anndan fonksyon ak respè y a, pou l' moins y au.

source: So it's minus 2y.
ht: Se konsa, li se moins 2 y. ...

source: And then the derivative of the whole thing is just itself again.
ht: Et puis dérivés de tout bagay an se tèt jis li ankò.

source: So times 10 e to the minus x squared plus y squared plus z squared.
ht: Sa fwa 10 e pou a x moins au plis y au plis z au.

source: And then all of that times the unit vector in the y direction times j.
ht: Epi lè sa a tout moun ki fwa a vecteur inite w la nan a y direksyon fwa j.

source: And then finally, the partial derivative of the temperature function with respect to z.
ht: Et puis finalman, la partielle dérivés de tanperati a fonksyon osijè de z.

source: And that's just minus 2z times 10 e to the minus x squared plus y squared plus z squared.
ht: E se jis moins 2z fwa 10 e pou a x moins au plus y au plis z au.

source: This is just the chain rule.
ht: A, se sèlman chèn.

source: And I'm treating the other two variables that I'm not taking the partial derivative with respect to, as constants.
ht: E m ap trete ak tout lòt de varyab sa mwen p ap pran a partielle dérivés ak respect pou, tankou constantes.

source: And then all of that times the unit vector in the k direction.
ht: Apre sa, lè sa a, tout moun ki toujou a vecteur inite w la nan direksyon k.

source: And we could simplify this a little bit.
ht: Apre sa, nou te kapab fasilite sa a. Se pou yon ti tan.

source: You could have minus 2x times 10.
ht: Ou te kapab gen moins x 2 fwa 10.

source: That's minus 20x.
ht: Sa se moins 20 x.

source: Let me write it up here.
ht: Kite m' ekri l' la anwo.

source: So the gradient of the temperature function is equal to minus 20 e to the minus x squared plus y squared-- you probably can't read this-- plus z squared, times i minus 20y.
ht: Se konsa dégradé fonksyon tanperati a egal-ego a moins 20 e pou a x moins au plus y au ­ ou yo pat kapab byen kapab li sa a - plus z au, fwa mwen moins 20 y.

source: And actually, I'm not going to go into that, because I realize
ht: E aktyèlman, m pa pral antre nan sa, paske mwen reyalize

source: I'm running out of time.
ht: M' ap kouri soti nan lè.

source: I think you can simplify this algebraically.
ht: Mwen panse ke nou kapab fasilite sa aljebrikman.

source: But anyway, the more important thing is I always find with gradients it's easy to calculate them, but the intuition-- oh sorry.
ht: Men, de tout fason, sa ki pi enpòtan se mwen toujou jwenn ak dégradé se fasil pou kalkile yo, men yo entwisyon an - o m regrèt.

source: This is also included.
ht: Men tou te gen ladann.

source: This is a k right here.
ht: Sa se yon k droit isit la.

source: The harder part is the intuition.
ht: W'a di pati a se a entwisyon an.

source: So let's get an intuition of what this gradient function will actually look like.
ht: Se konsa an nou jwenn yon entwisyon an ki sa a fonksyon dégradé a aktyèlman sanble.

source: So what would happen.
ht: Se poutèt sa ki ka rive.

source: If you wanted to know the gradient at any point in space, you would substitute an x, y, and z in here.
ht: Si ou te vle konnen a dégradé nan kèk pwen nan espas, ou ta ka ranplase yon x, y, ak z isit la.

source: So you could write it as the gradient function is a function of x, y, and z.
ht: Se konsa, ou te kapab ekri l' menm jan an fonksyon dégradé se yon fonksyon de x, y, Et z.

source: Remember, T, the temperature at any point, was a scalar field.
ht: Pa bliye, T, tanperati a sou tout pwen, te genyen yon gwo scalar.

source: At any point in three dimensions it just gave you a number.
ht: Nan tout pwen nan twa dimansyon li sèlman te ban nou anpil.

source: Now when you have the gradient, at any point in three dimensions it gives you a vector. Right?
ht: Ki lè ou gen dégradé la, nan yon pwen nan twa dimansyon l' ban nou yon vecteur. pa vre?

source: Because it has i, j, and k components.
ht: Paske li gen mwen la a, se j, Et composants k.

source: Where the magnitude are the partial derivatives, and then the direction is given by i, j, and k.
ht: Kote magnitid ki partielle dérivés, Et Lè sa a direksyon yo resevwa m, j ak k.

source: So we've gone from having a scalar field to a vector field.
ht: Se konsa nou te ankò gen yon jaden scalar pou yon jaden vecteur.

source: And let's see what it looks like.
ht: Et, ann wè sa li sanble ke. ...

source: And let me make it bigger so we can explore it a little bit.
ht: Et, kite m' fè l' pi bon pou nou ka egzamine sa yon ti jan. ...

source: I think that's pretty good.
ht: Mwen kwè ke sa trè bon.

source: So this is the vector field.
ht: Se poutèt sa se vecteur jaden.

source: This is actually the gradient of the function that we just solved for.
ht: Sa se aktyèlman dégradé fonksyon a sa nou jis rezoud pou.

source: And as you can see, at any point-- and when this graphing program that did it, it just picked different points and it calculated the gradients at that point, and then it graphed them as vectors.
ht: Et jan nou ka wè nan yon pwen - Et lè graphiques sa a pwogram sa te fè l, li annik pran diferan pwen ak li calculé dégradé yo nan pwen sa. Apre sa li sous yo kòm vecteurs.

source: So the length of the vectors are just the magnitudes of the x, y, and z components.
ht: Se konsa, la durée de vecteurs sont jis l' ampleur du a x, y ak z composants.

source: And then you add them together like you would add any vectors.
ht: Et puis ou adisyone yo ansanm tankou ou ta ajoute vecteurs tout.

source: And then the direction is given by the relative weighting of the i, j, and k components.
ht: Et puis direksyon sa a relatif pondération de a m, j ak k composants.

source: And as you can see, the intuition is pretty interesting.
ht: Menm jan ou ka wè, a entwisyon an, se bèl enteresan.

source: As you get closer and closer to our heat source, the rate at which the temperature increases, increases! Right?
ht: Menm jan ou jwenn plus Et plus pou nou chalè sòs, moun yo ki te konn nan ki te ogmante tanperati a, ap ogmante. pa vre?

source: The vectors as you get closer, get bigger and bigger.
ht: Vecteurs yo menm jan ou jwenn plus, obtenir plus Et plus.

source: And let me zoom in.
ht: Et, kite m' rale.

source: Let's actually fly in to the vector field.
ht: An n aktyèlman vole nan jaden vecteur a. ...

source: So we're now within the vector field.
ht: Se konsa nou gen koulye a nan jaden vecteur.

source: And you can see as we get closer and closer to the center of our heat source, the vectors, the rate at which the temperature increases, gets bigger and bigger and bigger.
ht: Et, ou kapab wè alò ke nap avanse plus Et plus pou sant nou chalè sòs, vecteurs yo, moun yo ki te konn kote a tanperati ogmante, pare pi gwo ak pi gwo ak pi gwo.

source: Anyway, I hope I didn't confuse you.
ht: De tout fason, mwen espere ke mwen pa t twouble w.

source: When I first learned gradients, I think the computation is relatively straightforward.
ht: Lè mwen te premye appris dégradé, mwen panse ke kalkil a se relativement simple.

source: It's just partial derivatives.
ht: Li se jis kèk dérivés partielle.

source: But the intuition is always the interesting thing.
ht: Men, a entwisyon an, se toujou sa enteresan.

source: And hopefully this temperature analogy-- and not even analogy-- this temperature model will make a little sense to you.
ht: Et que sa a tanperati analoji - e li pa menm analoji - modèl tanperati sa a ap fè yon ti sans pou ou.

source: But it applies to pretty much any scalar field.
ht: Men, li la pou bèl anpil tout jaden scalar.

source: We're standing in front of an unfinished painting by Leonardo da Vinci.
ht: Nou kanpe devan yon tablo enkonplè pa Leonardo da Vinci.

source: It's a big painting, and interestingly almost a perfect square.
ht: Sa se yon gwo tablo, Et est prèske yon kare.

source: It's really unfinished, not just some parts.
ht: Vrèman enkonplè, pa sèlman kèk pati li.

source: It's really just the underpainting.
ht: Se vwèman inikman underpainting.

source: This is the Adoration of the Magi.
ht: Sa se Adoration Des Rois yo.

source: A moment in Christian story when Christ has just been born and three kings from the east, guided by the star of Bethlehem, come to Mary and offer Christ three gifts: frankincense, myrrh, and gold.
ht: Yon ti moman nan istwa kretyen lè Christ te jis te fèt ak twa wa soti bò solèy leve mache dapre an Bethlehem, vin kay mari Et ofwi Christ kado twa: lansan, lami ak lò ki genyen.

source: Which revealed to us here, is Leonardo's working method
ht: Sa a pou nou isit la, se Leonardo a travay metòd

source: Not only his brilliant drawing, but the way which he constructs figures.
ht: Se pa sa sèlman dessin klere l, men chemen li construit chiffres.

source: Remember, that Leonardo is first and foremost not a painter, he's really a scientist, an engineer.
ht: Pa bliye, Leonardo se premye tout pa yon bòs pent, se vrèman yon syantis: enjenyè yon.

source: Somebody who looks and understands nature.
ht: Yon moun ki sanble ak konprann nati.

source: We sense Leonardo's deep understanding of human anatomy.
ht: Nou santi Leonardo a gwo basen byen fon konpweyansyon D' anatomie moun. / kè m boule m.

source: When he paints clothed figures, he's understanding the skeletal structures, the musculature of the body
ht: Lè li peintures figi abiye, li compréhension estrikti skèlèt iskilati de kò a

source: If you look to the group of figures to the right, about midlevel you see a figure that almost looks like a skull, as if literally
ht: Si ou gade nan gwoup la nan figi sou bò dwat, de midlevel ou wè yon figi ki pwèske parèt tankou yon zo tèt, tankou si mo pou mo

source: Leonardo reconstructs the bones, before he put flesh on them, before he put clothes on them, before he adds colors.
ht: Leonardo fidèlement zosman yo, anvan sa, li mete kò l ' sou yo, anvan sa, li mete rad sou yo, anvan sa, li ajoute ke, koulè.

source: That's a group of figures that often referred to as the philosophers.
ht: Sa se yon gwoup de figi sa souvan refere li kòm philosophes yo.

source: But may be we should discuss the central group first.
ht: Men, yo ka nou ta dwe diskite gwoup santral la anvan.

source: We have Mary and the Christ child, front and center, forming a pyramid shape together with the Magi in front.
ht: Nou gen Kris Mary Et a la timoun, Avant ak sant, faisant yon fòm Piramid lan ansanm ak Rois yo devan.

source: That's the shape that we see very often in paintings of the high Renaissance that provides a stable form.
ht: Sa se fòm sa nou wè trè souvan nan peintures de renesans anwo nan syèl la ki founi yon fòm stab.

source: You see that here in the foreground with Mary and Christ.
ht: Ou wè sa isit la nan plan a ansanm ak mari, ak nou.

source: It is essentially important in this painting which is so chaotic, with so much going on.
ht: Li enpòtan esansyèlman nan tablo sa a ki se konsa kaotik, ak pwal anpil.

source: At the upper right, there is a battle of 2 horses rearing up at the upper left, a fragment of a classical architecture. the wonderful steps and perfect linear perspective.
ht: Nan dwa anwo a, pa gen yon batay de 2 chwal evasyon leve sou bò a anwo gòch, kraze yon de yon Achitekti klasik. étapes mèveye Et pèspektiv nan afè pafè lineyè.

source: Leonardo did a brilliant drawing in preparation of this painting.
ht: Leonardo te fè yon briyan dessin nan pweparasyon de penti sa a.

source: But let's look more closely to define the pyramid lines.
ht: Men, ann gade plis pou kole ak defini Piramid lan nan lakou a.

source: Start with the Virgin Mary and look at her face.
ht: Kòmanse avèk Mari, jenn fi a ak gade sou figi l.

source: She's glancing across the top of her son's head down his arms, he 'picks up' her glance and brings her eye down until it is met by the Magi who's offering a gift.
ht: Li glancing Sur tèt pitit gason l' lan sou tèt anba bra l, li 'travayè' gade l' epi sa pote je l' jiskaske li te rankontre pa Rois ki ofwi yon kado.

source: Run the line down, past his toes, to the corner of the painting.
ht: Koule liy lan, pase tèt zòtèy pye l, pou yo la nan papòt la tablo a.

source: Or we can pick up from Mary and go the other way.
ht: Ou, nou ka ranmase de Mary e ale lòt bò.

source: From the bridge of her nose, across her shoulders, picked up by the kneeling figure at the left.
ht: De pon an bwa nen l, Sur l' zepòl, pwan pa figi s' lan sou bò gòch la.
